<style scoped>
* {
  margin: 0;
  padding: 0;
}
</style>

<script setup>
import { reactive, provide } from "vue";
import WaterfallFlow from "../views/WaterfallFlow.vue";
import page from "../views/page.vue";

const PictureCollection = reactive([
  {
    num: "麻婆豆腐",
    color: "#3498db",
    url: "src/assets/1麻婆豆腐-短图.jpg",
    height: "270px",
    price: 100,
    text: "麻婆豆腐是四川省传统名菜之一，属于川菜。这道菜以豆腐为主料，辅以蒜苗和牛肉沫（或其他肉类），调料包括豆瓣、辣椒面、花椒面等，口感麻辣鲜香，烫嫩酥整，充分展现了川菜麻辣味型的特点。",
    onClick: false,
  },
  {
    num: "辣子鸡",
    url: "src/assets/2辣子鸡-短图.jpg",
    color: "#2ecc71",
    height: "300px",
    text: "辣子鸡是一道经典的中国家常菜。这道菜色泽棕红油亮，口感麻辣味浓，香气四溢，鸡肉鲜嫩多汁，具有浓郁的鲜香和独特的辣味，是深受各地人们喜爱的佳肴。",
    price: 200,
    onClick: false,
  },
  {
    num: "锅巴肉片",
    color: "#95a5a6",
    url: "src/assets/3锅巴肉片-长图.jpg",
    height: "380px",
    text: "锅巴肉片是一道具有悠久历史的川菜名品，以其独特的口感和风味而深受人们喜爱。其主要食材包括猪里脊肉、大米锅巴，以及玉兰片、水发冬菇、豌豆苗等配料。烹饪过程中，肉片被烹饪得滑嫩可口，锅巴则炸至酥脆金黄。当滚烫的卤料浇在锅巴上时，会发出呲啦一阵响，肉汁嵌入锅巴缝隙中，使得锅巴酥软可口，香气四溢。",
    price: 300,
    onClick: false,
  },
  {
    num: "火爆腰肝",
    color: "#7f8c8d",
    url: "src/assets/4火爆腰肝-短图.jpg",
    height: "300px",
    text: "火爆腰花是一道以猪腰为主料制作的家常菜，属于川菜或鲁菜系列。其特色在于猪腰被切成花纹后爆炒，口感鲜嫩且味道醇厚。猪腰子具有补肾气、通膀胱等功效，但因其为猪的排泄器官，处理时需去净骚味。火爆腰花的制作过程考验厨师的刀工和对火候的掌握，成品色泽鲜亮，口感滑润不腻，是广受欢迎的美食佳肴。",
    price: 200,
    onClick: false,
  },
  {
    num: "红油耳片",
    color: "#e74c3c",
    height: "180px",
    url: "src/assets/17红油耳片-短图.jpg",
    text: "红油耳片是一道源自四川省的汉族传统名菜，属于川菜系。其以猪耳为主料，搭配红辣椒油等调味品调制而成，口感香辣微甜，质地脆嫩，深受食客喜爱。红油耳片不仅美味可口，还具有补虚损、健脾胃的功效，适用于各种场合食用。作为川菜中的经典菜品，红油耳片以其独特的魅力和风味，成为了代表中国美食文化的重要名片之一。",
    price: 60,
    onClick: false,
  },
  {
    num: "蒜泥白肉",
    color: "#897f85",
    url: "src/assets/19蒜泥白肉-短图.jpg",
    height: "200px",
    text: "蒜泥白肉是一道源自中国四川的经典冷菜，以肥瘦相间的猪肉片为主，佐以蒜泥、辣椒油、酱油等调料制成。其口感鲜嫩，蒜香浓郁，微辣中带着鲜香，深受食客喜爱。作为川菜系中的佳肴，蒜泥白肉以其独特的风味和制作工艺，成为展现中国美食文化魅力的一道亮丽风景。",
    price: 100,
    onClick: false,
  },
  {
    num: "藿香鲫鱼",
    color: "#2ecc71",
    url: "src/assets/5藿香鲫鱼-短图.jpg",
    price: 200,
    text: "藿香鲫鱼是一道经典的四川名菜，以鲫鱼和藿香为主要原料。这道菜肉质细嫩，肉味甜美，藿香的特殊香气与鲜嫩的鱼肉相得益彰，口感鲜美，营养丰富。藿香不仅具有祛暑解表、化湿和胃的功效，其含有的挥发油、黄酮类化合物等成分还具有抗菌、抗炎、抗氧化等作用，有助于提高身体免疫力。",
    height: "280px",
    onClick: false,
  },
  {
    num: "肥肠血旺",
    color: "#27ae60",
    url: "src/assets/20肥肠血旺-短图.jpg",
    height: "190px",
    text: "肥肠血旺是一道源自四川的经典美食，以猪肥肠和猪血为主要食材，经过精心烹制而成。这道菜色泽红亮，口感麻辣鲜香，肥肠的鲜嫩与猪血的细腻完美结合，入口即化，令人回味无穷。作为川菜中的佼佼者，肥肠血旺不仅美味可口，还承载着浓厚的川菜文化，深受食客喜爱。",
    price: 60,
    onClick: false,
  },
  {
    num: "火爆肥肠",
    color: "#34495e",
    url: "src/assets/13火爆肥肠-长图.jpg",
    height: "450px",
    text: "火爆肥肠是一道色香味俱佳的家常菜，以猪大肠为主料，通过独特的烹饪方式，使其口感鲜嫩、味道醇厚。猪大肠具有润燥、补虚、止渴止血等功效，使得这道菜不仅美味可口，还具有一定的营养价值。火爆肥肠的烹饪过程通常包括焯水、油炸、爆炒等步骤，旨在充分展现其香浓的口感和丰富的层次。无论是作为开胃菜还是主菜，火爆肥肠都能让人回味无穷，深受食客喜爱。",
    price: 300,
    onClick: false,
  },
  {
    num: "水煮肉片",
    color: "#95a5a6",
    height: "360px",
    url: "src/assets/8水煮肉片-短图.jpg",
    price: 100,
    text: "水煮肉片是一道源自四川的地方新创名菜，以其肉味香辣、软嫩、易嚼而著称。主要食材为猪里脊肉，搭配多种调料和辅料，经过精心烹制而成。这道菜口感麻辣味浓，汤红油亮，具有麻、辣、鲜、香的特点，既美味又下饭。水煮肉片的烹饪方法科学，保持了肉质的鲜嫩，同时避免了长时间高温油炸可能产生的致癌物质，是家常美食的优选之一。",
    onClick: false,
  },
  {
    num: "甜烧白",
    color: "#34495e",
    height: "270px",
    price: 200,
    url: "src/assets/10甜烧白-短图.jpg",
    onClick: false,
    text: "甜烧白，也被称为夹沙肉，是源自中国四川省的一道传统名菜。其主要食材包括五花肉、糯米和豆沙。这道菜将豆沙巧妙地夹入五花肉片中，经过蒸制后，肉质酥软，口感鲜香甜糯，色泽红亮，咸鲜味浓，肥而不腻，深受当地民众喜爱。甜烧白不仅色感口感俱佳，而且营养丰富，具有补充皮肤养分、美容的效果，是一道兼具美味与健康的美食佳肴。",
  },
  {
    num: "口水鸡",
    color: "#e67e22",
    height: "220px",
    url: "src/assets/7口水鸡-长图.jpg",
    price: 80,
    text: "口水鸡是一道源自中国四川省达州市的传统名菜，属于川菜系列。其特色在于佐料丰富，口感麻辣鲜香，集嫩爽于一身，因而享有“名驰巴蜀三千里，味压江南十二州”的美誉。在烹制时，煮鸡用的汤料有讲究，需恰到好处以保留鸡的可溶性蛋白，增添鲜美与特有香型。此外，口水鸡不仅美味，还寓意着繁荣与吉祥，深受食客喜爱。",
    onClick: false,
  },
  {
    num: "蒜蓉龙虾",
    color: "#95a5a6",
    height: "450px",
    url: "src/assets/9蒜蓉龙虾-长图.jpg",
    price: 300,
    text: "蒜蓉龙虾是一道美味佳肴，以小龙虾和蒜蓉为主要食材。其特点在于蒜香味浓郁，口感鲜美，肉质鲜嫩多汁。烹饪过程中，蒜蓉经过爆炒后与佐料完美融合，为龙虾增添了丰富的口感层次。这道菜不仅味道诱人，还富含蛋白质、维生素等营养物质，是一道健康又美味的菜品。无论是家庭聚餐还是朋友聚会，蒜蓉龙虾都是不错的选择。",
    onClick: false,
  },
  {
    num: "盐煎肉",
    color: "#2aace8",
    height: "200px",
    url: "src/assets/21盐煎肉-短图.jpg",
    price: 100,
    text: "盐煎肉是四川传统特色名菜，属于川菜系，与回锅肉共称为姐妹菜。它以猪后臀肉为原料，经过精心烹制，肉片鲜嫩、颜色深红、干香酥嫩、味道鲜美，具有浓厚的地方风味。在四川、重庆地区，盐煎肉是家喻户晓的下酒佐餐佳肴，其独特的口感和风味深受食客喜爱。",
    onClick: false,
  },
  {
    num: "粉蒸排骨",
    color: "#702ecc",
    height: "350px",
    url: "src/assets/18粉蒸排骨-短图.jpg",
    price: 200,
    text: "粉蒸排骨，这道菜肴不仅味道醇厚，而且蕴含着深厚的中华饮食文化。它起源于中国的南方，尤其是长江流域一带，是当地人民在长期烹饪实践中创造出来的一道美味佳肴。这道菜肴以其独特的制作工艺和风味特点，逐渐在全国范围内流传开来，成为众多食客的心头好。",
    onClick: false,
  },
  {
    num: "老妈蹄花",
    color: "#79e82a",
    height: "470px",
    url: "src/assets/14老妈蹄花-长图.jpg",
    price: 300,
    text: "老妈蹄花是四川省成都市的一道特色传统名吃，属于川菜系。这道菜以猪蹄为主要原料，搭配白芸豆等调味品精心煲煮而成。其外观肌肤胜雪，形似飞花，口感滑嫩细致，柔嫩爽口，香而不腻。经过炖煮，猪蹄的胶原蛋白充分释放，使得汤品不仅美味，还富含营养。老妈蹄花因其独特的口感和营养价值，深受食客喜爱，是成都风味名吃中的上品。",
    onClick: false,
  },
  {
    num: "芋儿烧鸡",
    color: "#d2e82a",
    url: "src/assets/11芋儿烧鸡-短图.jpg",
    height: "300px",
    price: 100,
    text: "芋儿烧鸡是一道源自四川的地方名菜，以鸡肉和芋头为主要食材。这道菜麻辣香浓，鸡肉嫩滑，芋头软糯回甜，色泽红亮，口感丰富。芋儿烧鸡不仅美味可口，而且鸡肉和芋头都富含营养，是一道深受人们喜爱的佳肴。在四川，这道菜几乎家喻户晓，是川菜中的经典之一。",
    onClick: false,
  },
  {
    num: "甜皮鸭",
    color: "#d2e82a",
    url: "src/assets/16甜皮鸭-长图.jpg",
    height: "280px",
    price: 100,
    text: "甜皮鸭，又称卤鸭子或甜皮卤鸭，是乐山地区的传统美食，源于清朝御膳工艺。经过民间发掘与改进，其卤水独具特色，成品色泽棕红、皮酥略甜、肉质细嫩、香气宜人。制作过程中，需经过卤制、油炸等多道工序，最后淋上糖汁，使得甜皮鸭外皮酥脆、肉质紧实，口感丰富，甜咸适中，令人回味无穷。甜皮鸭不仅是一道美味的佳肴，更承载着乐山地区深厚的饮食文化，深受食客喜爱。",
    onClick: false,
  },
  {
    num: "尖椒兔丁",
    color: "#d2e82a",
    height: "370px",
    url: "src/assets/6尖椒兔丁-长图。.jpg",
    price: 100,
    text: "尖椒兔丁是一道具有浓郁辣味的川菜，以兔肉为主料，搭配尖椒、花椒等调料炒制而成。其口感鲜嫩，麻辣味浓，深受食客喜爱。同时，尖椒兔丁也是一道营养丰富的佳肴，富含蛋白质和多种矿物质，适量食用有益健康。在烹饪过程中，需要注意火候的掌握和调料的搭配，以呈现出最佳的口感和风味。",
    onClick: false,
  },
  {
    num: "干锅虾",
    color: "#d2e82a",
    height: "270px",
    url: "src/assets/12干锅虾-短图.jpg",
    price: 100,
    text: "干锅虾是一道色香味俱佳的海鲜佳肴，以虾为主料，搭配多种蔬菜和调料烹制而成。其口感鲜美，肉质鲜嫩，营养丰富，富含蛋白质、微量元素等，深受食客喜爱。干锅虾的特色在于其独特的烹饪方式，通过干锅慢炒的方式，让虾肉充分吸收调料的香味，味道醇厚，回味无穷。同时，配以多种蔬菜和辣椒，不仅增加了口感层次，也提升了营养价值。无论是家庭聚餐还是朋友聚餐，干锅虾都是一道不错的选择。",
    onClick: false,
  },
  {
    num: "夫妻肺片",
    color: "#6b4d4d",
    height: "220px",
    price: 200,
    url: "src/assets/15夫妻肺片-短图.jpg",
    onClick: false,
    text: "夫妻肺片，川菜中的璀璨明星，以其麻辣鲜香、口感细腻而著称。这道菜起源于四川成都，据传由一对夫妻创制，故名“夫妻肺片”。如今，它已经成为四川省的代表性美食，深受食客喜爱。",
  },
]);

provide("PictureCollection", PictureCollection);
</script>
<template>
  <div>
    <!-- <page /> -->
    <WaterfallFlow :pictures="PictureCollection" />
  </div>
</template>
